In [10]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [3]:
df = pd.read_csv("raw_data.csv", index_col= 0) ## de cara a la exportación para no duplicar el index fantasma

In [11]:
lista_errores = []

def cambiar_comas(dato):
    try:
        return float(dato.replace(",", "."))
    except:
        lista_errores.append(dato)
        return np.nan

In [12]:
lista_col = ["sameasmonthlyincome",  "salary", "monthlyincome", "monthlyrate", "performancerating"]

In [13]:
for col in lista_col:
    print(col)
    df[col] = df[col].apply(cambiar_comas)

sameasmonthlyincome
salary
monthlyincome
monthlyrate
performancerating

In [15]:
df

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,NaN,NaN,7,Y,No,13,3.0,3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,NaN,1972,NaN,NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,NaN,0,NaN,NaN,14,3.0,1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,NaN,NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,NaN,1,NaN,No,11,3.0,4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,NaN,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,NaN,NaN,3,Y,NaN,19,3.0,2,Full Time,2,NaN,2,NaN,20,NaN,5,6,NaN,1976,NaN,NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,NaN,NaN,2,Y,No,12,3.0,4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,NaN,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1673,43,No,NaN,488.944444,NaN,-26,3,Medical,1,824,2,1,NaN,4,1,rESEaRcH SciEnTiST,3,Single,NaN,NaN,4,NaN,NaN,12,3.0,4,NaN,0,NaN,2,"3,0",3,NaN,1,2,NaN,1980,NaN,NaN,NaN,Yes
1674,47,No,NaN,1973.984127,NaN,26,4,NaN,1,1087,4,1,NaN,3,5,mANager,3,Married,NaN,NaN,3,Y,No,11,3.0,3,Full Time,1,"27,0",2,"3,0",5,NaN,1,0,NaN,1976,NaN,NaN,NaN,False
1675,29,No,travel_rarely,290.035510,NaN,15,3,NaN,1,528,3,0,NaN,3,1,reSearch sCienTiSt,4,NaN,NaN,NaN,1,NaN,No,19,3.0,1,Part Time,0,"6,0",1,"3,0",6,NaN,1,5,NaN,1994,NaN,NaN,NaN,False
1676,47,No,travel_rarely,1032.487286,NaN,4,3,Life Sciences,1,76,3,1,NaN,2,3,maNufACTURING DIREctOr,2,Divorced,NaN,NaN,8,NaN,Yes,12,NaN,3,Part Time,1,NaN,4,"3,0",22,NaN,14,10,NaN,1976,NaN,NaN,NaN,Yes
1677,32,No,NaN,556.256661,NaN,2,2,Life Sciences,1,401,4,1,69.532083,3,2,resEArch scIENTisT,3,Single,NaN,NaN,4,Y,Yes,14,3.0,4,Part Time,0,"10,0",2,"3,0",8,NaN,0,7,NaN,1991,NaN,NaN,NaN,0

In [14]:
df["salary"]

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
        ..
1673   NaN
1674   NaN
1675   NaN
1676   NaN
1677   NaN
Name: salary, Length: 1678, dtype: float64

In [ ]:
$--> hourlyrate - ya tiene punto y no tiene $ (limpio) HACER round(2) para solo ensenar centimos.
COMMA a PUNTO: performancerating, worklifebalance -- podrian ser int o float

In [ ]:

CAMBIAR comma a punto, quitar $, float: sameasmonthlyincome,  salary, monthlyincome, monthlyrate
,
$ -->daily rate - ya tiene punto y no tiene $ (limpio) HACER round(2) para solo ensenar centimos.